<template lang="html">
  <main id="main" class="main mpu" v-once>
    <section class="intro">
      <div class="container">
        <div class="intro-column">
          <h1 class="intro__title">
            Разработка дизайна сайта
            и веб-приложения MPU Leicht
          </h1>
          <h2 class="intro__sub-title">
            Разработка дизайна сайта и веб-приложения для
            компании, специализирующейся на подготовке к MPU
            тесту (медицинская психологическая экспертиза).
          </h2>
        </div>
        <video class="intro__video" controls loop autoplay>
          <source src="/static/mpu/Statistic.ogv" type='video/ogg'>
          <source src="/static/mpu/Statistic.mp4" type='video/mp4'>
          <source src="/static/mpu/Statistic.webm" type='video/webm'>
          Элемент video не поддерживается вашим браузером.
          <a href="/static/mpu/Statistic.mp4">Скачайте видео</a>.
        </video>
      </div>
    </section>

    <section class="description">
      <div class="container">
        <div class="description-column">
          <h1 class="description__title">
            MPU Leicht
          </h1>
          <p class="description__text">
            Компания специализируется на проведении
            обучения и дальнейшей аттестации
            владельцев школ вождения.
          </p>
        </div>
        <div class="description-column">
          <h2 class="description__task">Задача:</h2>
          <p class="description__task-detail">
            Разработать всю визуальную составляющую
            сайта и веб-приложения (desktop/tablet/mobile)
            + анимацию для разработчиков.
          </p>
        </div>
      </div>
    </section>

    <section class="first-step">
      <div class="container" data-aos="fade-up">
        <h3 class="first-step__title">Описание ТЗ:</h3>
        <p class="first-step__text">
          Компания специализируется на предоставлении полномочий на подготовку людей потерявших
          права к сдаче MPU теста. MPU — медицинская психологическая экспертиза, смысл и цель которой
          определить, представляет ли испытуемый опасность для окружающих.
        </p>
      </div>
    </section>

    <section class="mpu-image">
      <div class="container">
        <img src="/static/mpu/screen-statistic.jpg" alt="Страница новых задач" class="mpu-image__picture" />
      </div>
    </section>

    <section class="workflow">
      <div class="container">
        <h3 class="workflow__title">Процесс работы:</h3>
        <p class="workflow__text">
          Цели сайта — информирование клиентов об услугах компании, продвижение бренда "MPU für Fahrschulen" (MPU для школ вождения) как единственную, успешную, надежную
          и развивающуюся фирму на рынке, популяризация положительного имиджа компании
          и привлечение новых заказчиков на услуги компании. <br/><br/>

          Целевая аудитория — собственники и руководители автошкол, желающие получить дополнительный доход. <br/><br/>

          Дизайн должен быть лёгким, светлым, строгим, а все страницы должны иметь единую стилистику.
          Макеты было договорено передать через Zeplin, для отрисовки использовать Sketch, для анимации — Adobe AE.
        </p>
        <ul class="workflow-list">
          <li v-for="appItem in Apps" :key="appItem.name"
              class="workflow-item">
            <img :src=" '/static/apps/' + appItem.icon " :alt="appItem.name"
                 class="workflow-item__icon" />
          </li>
        </ul>
      </div>
    </section>

    <section class="adaptivity">
      <div class="container">
        <img src="/static/mpu/mpu-mobile.png" alt="Адаптивность в подарок"
             class="adaptivity__picture _first" />
        <div class="adaptivity-column">
          <h3 class="adaptivity__title">Адаптивность</h3>
          <p class="adaptivity__text">
            Помимо десктоп версии, были также отрисованы макеты под разрешения мобильных устройств и планшетов.
            <br/><br/>
            Для смартфонов 320px, для планшетов 768px, для десктоп 1280px по ширине. Всего получилось 48 экранов.
          </p>
        </div>
      </div>
    </section>

    <section class="concept">
      <div class="container">
        <h3 class="concept__title">Концепция:</h3>
        <p class="concept__text">
          Дизайн сайта выполнен в формате одноэкранника SPA — т.е. Single Page Application. Здесь нет классического скролла, а при нажатии на кнопки навигации/скроллом колесиком мышки экраны сменяются анимацией. Смотрится стильно и очень приятно.
        </p>
      </div>
    </section>

    <section class="mpu-image _about">
      <div class="container">
        <img src="/static/mpu/screen-about.jpg" alt=""
             class="mpu-image__picture" />
      </div>
    </section>

    <section class="concept">
      <div class="container">
        <h3 class="concept__title">Веб-приложение:</h3>
        <p class="concept__text">
          Дизайн сайта выполнен в формате одноэкранника SPA — т.е. Single Page Application. Здесь нет классического скролла, а при нажатии на кнопки навигации/скроллом колесиком мышки экраны сменяются анимацией. Смотрится стильно и очень приятно.
        </p>
      </div>
    </section>

    <section :class="{ '_fallback': isIOS }" class="parallax"></section>

    <section class="review">
      <span class="review__back">TYPOGRAPHY</span>
      <div class="container">
        <div class="review-column">
          <h3 class="review__title">Шрифты и цвет</h3>
          <p class="review__text">
            Проект выполнен в фирменных цветах
            компании MPU Leicht, которые были указаны
            в ТЗ. А именно — темно-синий как основной,
            оранжевый и голубой как акцентные.
          </p>
        </div>
        <div class="review-column">
          <ul class="review-list">
            <li class="review-list-item _big">
              <p class="review-list-item__title">
                <svg width="80px" height="14px" viewBox="0 0 80 14" version="1.1" xmlns="http://www.w3.org/2000/svg">
                  <title>HEADERS</title>
                  <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" transform="translate(-760.000000, -5155.000000)">
                    <path d="M768.01,5155.27 C767.452,5155.27 767.272,5155.45 767.272,5156.008 L767.272,5160.238 L762.934,5160.238 L762.934,5156.008 C762.934,5155.45 762.754,5155.27 762.196,5155.27 L760.738,5155.27 C760.18,5155.27 760,5155.45 760,5156.008 L760,5167.312 C760,5167.87 760.18,5168.05 760.738,5168.05 L762.196,5168.05 C762.754,5168.05 762.934,5167.87 762.934,5167.312 L762.934,5162.92 L767.272,5162.92 L767.272,5167.312 C767.272,5167.87 767.452,5168.05 768.01,5168.05 L769.468,5168.05 C770.026,5168.05 770.188,5167.87 770.188,5167.312 L770.188,5156.008 C770.188,5155.45 770.026,5155.27 769.468,5155.27 L768.01,5155.27 Z M773.14,5155.27 C772.582,5155.27 772.402,5155.45 772.402,5156.008 L772.402,5167.312 C772.402,5167.87 772.582,5168.05 773.14,5168.05 L780.556,5168.05 C781.114,5168.05 781.294,5167.87 781.294,5167.312 L781.294,5166.106 C781.294,5165.584 781.078,5165.368 780.556,5165.368 L775.336,5165.368 L775.336,5162.92 L779.476,5162.92 C780.034,5162.92 780.214,5162.74 780.214,5162.182 L780.214,5160.976 C780.214,5160.418 780.034,5160.256 779.476,5160.256 L775.336,5160.256 L775.336,5157.934 L780.376,5157.934 C780.934,5157.934 781.114,5157.772 781.114,5157.214 L781.114,5156.008 C781.114,5155.45 780.934,5155.27 780.376,5155.27 L773.14,5155.27 Z M789.718,5155.846 L794.02,5167.33 C794.2,5167.816 794.038,5168.05 793.534,5168.05 L792.184,5168.05 C791.302,5168.05 791.014,5167.906 790.852,5167.384 L790.294,5165.692 L785.848,5165.692 L785.272,5167.384 C785.074,5167.906 784.84,5168.05 783.958,5168.05 L782.716,5168.05 C782.212,5168.05 782.05,5167.816 782.23,5167.33 L786.532,5155.882 C786.694,5155.396 786.91,5155.27 787.432,5155.27 L788.818,5155.27 C789.34,5155.27 789.556,5155.396 789.718,5155.846 Z M789.538,5163.316 L788.602,5160.526 C788.368,5159.752 788.188,5158.78 788.17,5158.294 L788.152,5157.952 L787.972,5157.952 C787.99,5158.798 787.846,5159.662 787.558,5160.508 L786.622,5163.316 L789.538,5163.316 Z M795.748,5155.27 L799.96,5155.27 C803.344,5155.27 805.27,5157.088 805.27,5160.112 L805.27,5163.208 C805.27,5166.232 803.344,5168.05 799.96,5168.05 L795.748,5168.05 C795.19,5168.05 795.01,5167.87 795.01,5167.312 L795.01,5156.008 C795.01,5155.45 795.19,5155.27 795.748,5155.27 Z M802.354,5163.208 L802.354,5160.112 C802.354,5158.654 801.544,5157.934 799.942,5157.934 L797.944,5157.934 L797.944,5165.368 L799.942,5165.368 C801.544,5165.368 802.354,5164.648 802.354,5163.208 Z M807.862,5155.27 C807.304,5155.27 807.124,5155.45 807.124,5156.008 L807.124,5167.312 C807.124,5167.87 807.304,5168.05 807.862,5168.05 L815.278,5168.05 C815.836,5168.05 816.016,5167.87 816.016,5167.312 L816.016,5166.106 C816.016,5165.584 815.8,5165.368 815.278,5165.368 L810.058,5165.368 L810.058,5162.92 L814.198,5162.92 C814.756,5162.92 814.936,5162.74 814.936,5162.182 L814.936,5160.976 C814.936,5160.418 814.756,5160.256 814.198,5160.256 L810.058,5160.256 L810.058,5157.934 L815.098,5157.934 C815.656,5157.934 815.836,5157.772 815.836,5157.214 L815.836,5156.008 C815.836,5155.45 815.656,5155.27 815.098,5155.27 L807.862,5155.27 Z M818.374,5155.27 L823.36,5155.27 C825.97,5155.27 827.608,5156.818 827.608,5159.41 C827.608,5161.228 826.906,5162.47 825.52,5163.1 C825.556,5163.154 825.682,5163.352 825.898,5163.73 L827.752,5167.276 C828.022,5167.708 827.896,5168.05 827.374,5168.05 L825.934,5168.05 C825.016,5168.05 824.692,5167.906 824.422,5167.348 L823.09,5164.576 C822.676,5163.73 822.334,5163.514 821.308,5163.514 L820.57,5163.514 L820.57,5167.312 C820.57,5167.87 820.39,5168.05 819.832,5168.05 L818.374,5168.05 C817.816,5168.05 817.636,5167.87 817.636,5167.312 L817.636,5156.008 C817.636,5155.45 817.816,5155.27 818.374,5155.27 Z M824.188,5160.49 C824.44,5160.238 824.566,5159.878 824.566,5159.41 C824.566,5158.942 824.44,5158.582 824.188,5158.312 C823.918,5158.06 823.558,5157.934 823.072,5157.934 L820.57,5157.934 L820.57,5160.886 L823.072,5160.886 C823.558,5160.886 823.918,5160.76 824.188,5160.49 Z M829.102,5159.032 C829.102,5160.31 829.624,5161.264 830.218,5161.768 C830.506,5162.02 830.92,5162.236 831.442,5162.416 C831.964,5162.596 832.378,5162.704 832.72,5162.758 C833.062,5162.812 833.512,5162.884 834.088,5162.956 C835.654,5163.118 836.518,5163.442 836.518,5164.252 C836.518,5165.206 835.726,5165.674 834.124,5165.674 C832.954,5165.674 832.18,5165.26 831.802,5164.432 C831.568,5163.874 831.37,5163.802 830.848,5164 L829.534,5164.468 C829.03,5164.666 828.904,5164.882 829.066,5165.404 C829.786,5167.348 831.478,5168.32 834.124,5168.32 C835.762,5168.32 837.076,5167.942 838.03,5167.186 C838.984,5166.448 839.47,5165.44 839.47,5164.198 C839.47,5162.974 839.02,5162.038 838.462,5161.498 C838.174,5161.228 837.796,5161.012 837.346,5160.814 C836.428,5160.454 835.816,5160.364 834.808,5160.238 C833.926,5160.148 833.494,5160.076 832.936,5159.878 C832.36,5159.68 832.108,5159.356 832.108,5158.906 C832.108,5158.042 832.738,5157.664 834.232,5157.664 C835.258,5157.664 835.96,5158.06 836.356,5158.852 C836.626,5159.338 836.806,5159.428 837.292,5159.212 L838.66,5158.618 C839.182,5158.402 839.29,5158.15 839.056,5157.646 C838.21,5155.846 836.806,5155 834.232,5155 C830.974,5155 829.102,5156.638 829.102,5159.032 Z" id="HEADERS" fill="#FF144B"></path>
                  </g>
                </svg>
              </p>
              <svg class="review-list-item__content" width="73px" height="52px" viewBox="0 0 73 52" version="1.1" xmlns="http://www.w3.org/2000/svg">
                <title>H1</title>
                <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" transform="translate(-824.000000, -5194.000000)">
                  <path d="M856.04,5194 C853.808,5194 853.088,5194.72 853.088,5196.952 L853.088,5213.872 L835.736,5213.872 L835.736,5196.952 C835.736,5194.72 835.016,5194 832.784,5194 L826.952,5194 C824.72,5194 824,5194.72 824,5196.952 L824,5242.168 C824,5244.4 824.72,5245.12 826.952,5245.12 L832.784,5245.12 C835.016,5245.12 835.736,5244.4 835.736,5242.168 L835.736,5224.6 L853.088,5224.6 L853.088,5242.168 C853.088,5244.4 853.808,5245.12 856.04,5245.12 L861.872,5245.12 C864.104,5245.12 864.752,5244.4 864.752,5242.168 L864.752,5196.952 C864.752,5194.72 864.104,5194 861.872,5194 L856.04,5194 Z M889.304,5194 C887.792,5194 886.424,5194.36 885.128,5195.152 L872.096,5202.712 C870.08,5203.864 869.72,5204.728 870.656,5206.672 L873.176,5211.208 C874.184,5213.152 875.696,5213.512 877.64,5212.36 L884.624,5208.4 L884.624,5242.168 C884.624,5244.4 885.344,5245.12 887.576,5245.12 L893.408,5245.12 C895.64,5245.12 896.36,5244.4 896.36,5242.168 L896.36,5196.952 C896.36,5194.72 895.64,5194 893.408,5194 L889.304,5194 Z" id="H1" fill="#202020"></path>
                </g>
              </svg>
              <p class="review-list-item__description">Pantone ExtraBold</p>
            </li>
            <li class="review-list-item _big">
              <p class="review-list-item__title">
                <svg width="41px" height="13px" viewBox="0 0 41 13" version="1.1" xmlns="http://www.w3.org/2000/svg">
                  <title>TEXT</title>
                  <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" transform="translate(-1040.000000, -5155.000000)">
                    <path d="M1040.36,5155 C1040.09,5155 1040,5155.09 1040,5155.36 L1040,5155.864 C1040,5156.134 1040.09,5156.224 1040.36,5156.224 L1043.996,5156.224 L1043.996,5167.42 C1043.996,5167.69 1044.086,5167.78 1044.356,5167.78 L1044.95,5167.78 C1045.22,5167.78 1045.31,5167.69 1045.31,5167.42 L1045.31,5156.224 L1048.946,5156.224 C1049.216,5156.224 1049.306,5156.134 1049.306,5155.864 L1049.306,5155.36 C1049.306,5155.09 1049.216,5155 1048.946,5155 L1040.36,5155 Z M1051.304,5155 C1051.034,5155 1050.944,5155.09 1050.944,5155.36 L1050.944,5167.42 C1050.944,5167.69 1051.034,5167.78 1051.304,5167.78 L1058.828,5167.78 C1059.062,5167.78 1059.17,5167.654 1059.17,5167.42 L1059.17,5166.916 C1059.17,5166.682 1059.062,5166.556 1058.828,5166.556 L1052.24,5166.556 L1052.24,5161.912 L1057.784,5161.912 C1058.018,5161.912 1058.126,5161.786 1058.126,5161.552 L1058.126,5161.048 C1058.126,5160.814 1058.018,5160.688 1057.784,5160.688 L1052.24,5160.688 L1052.24,5156.224 L1058.594,5156.224 C1058.828,5156.224 1058.936,5156.098 1058.936,5155.864 L1058.936,5155.36 C1058.936,5155.126 1058.828,5155 1058.594,5155 L1051.304,5155 Z M1066.262,5161.282 L1070.546,5155.342 C1070.672,5155.18 1070.6,5155 1070.366,5155 L1069.646,5155 C1069.268,5155 1069.16,5155.036 1068.998,5155.306 L1065.452,5160.256 L1061.924,5155.306 C1061.726,5155.036 1061.618,5155 1061.24,5155 L1060.52,5155 C1060.286,5155 1060.214,5155.18 1060.34,5155.342 L1064.606,5161.282 L1060.214,5167.402 C1060.07,5167.6 1060.106,5167.78 1060.376,5167.78 L1061.06,5167.78 C1061.474,5167.78 1061.582,5167.744 1061.744,5167.456 L1065.398,5162.29 L1069.106,5167.456 C1069.25,5167.744 1069.358,5167.78 1069.79,5167.78 L1070.51,5167.78 C1070.798,5167.78 1070.834,5167.6 1070.69,5167.402 L1066.262,5161.282 Z M1071.554,5155 C1071.284,5155 1071.194,5155.09 1071.194,5155.36 L1071.194,5155.864 C1071.194,5156.134 1071.284,5156.224 1071.554,5156.224 L1075.19,5156.224 L1075.19,5167.42 C1075.19,5167.69 1075.28,5167.78 1075.55,5167.78 L1076.144,5167.78 C1076.414,5167.78 1076.504,5167.69 1076.504,5167.42 L1076.504,5156.224 L1080.14,5156.224 C1080.41,5156.224 1080.5,5156.134 1080.5,5155.864 L1080.5,5155.36 C1080.5,5155.09 1080.41,5155 1080.14,5155 L1071.554,5155 Z" id="TEXT" fill="#FF144B"></path>
                  </g>
                </svg>
              </p>
              <svg class="review-list-item__content" width="78px" height="53px" viewBox="0 0 78 53" version="1.1" xmlns="http://www.w3.org/2000/svg">
                <title>Aa</title>
                <g stroke="none" stroke-width="1" fill="none" fill-rule="evenodd" transform="translate(-1101.000000, -5193.000000)">
                  <path d="M1126.27649,5194.152 L1145.57249,5242.968 C1145.93249,5243.904 1145.64449,5244.336 1144.56449,5244.336 L1142.47649,5244.336 C1140.96449,5244.336 1140.10049,5243.904 1139.88449,5243.04 L1134.48449,5229.36 L1111.94849,5229.36 L1106.54849,5243.04 C1106.26049,5244.12 1105.75649,5244.336 1104.02849,5244.336 L1102.08449,5244.336 C1101.07649,5244.336 1100.78849,5243.904 1101.14849,5242.968 L1120.44449,5194.224 C1120.73249,5193.432 1121.30849,5193 1122.24449,5193 L1124.40449,5193 C1125.34049,5193 1125.98849,5193.36 1126.27649,5194.152 Z M1133.04449,5225.04 L1124.40449,5202.936 C1123.75649,5200.992 1123.39649,5199.336 1123.39649,5197.968 L1123.03649,5197.968 C1123.03649,5199.48 1122.74849,5201.136 1122.17249,5202.936 L1113.46049,5225.04 L1133.04449,5225.04 Z M1149.74849,5213.808 C1152.41249,5208.768 1157.23649,5206.248 1164.22049,5206.248 C1174.87649,5206.248 1178.62049,5211.792 1178.62049,5220.504 L1178.62049,5239.368 C1178.62049,5241.888 1178.04449,5242.608 1176.02849,5243.472 C1173.14849,5244.696 1169.18849,5245.344 1164.07649,5245.344 C1158.10049,5245.344 1154.06849,5244.48 1151.83649,5242.608 C1149.60449,5240.808 1148.52449,5238 1148.52449,5234.184 C1148.52449,5226.048 1152.91649,5223.024 1164.36449,5223.024 C1166.30849,5223.024 1169.47649,5223.24 1173.79649,5223.744 L1173.79649,5220.432 C1173.79649,5214.168 1171.34849,5210.568 1164.07649,5210.568 C1159.32449,5210.568 1155.94049,5212.296 1153.99649,5215.824 C1153.49249,5216.544 1152.84449,5216.76 1152.19649,5216.4 L1150.46849,5215.68 C1149.53249,5215.32 1149.31649,5214.744 1149.74849,5213.808 Z M1173.79649,5238.072 L1173.79649,5227.704 C1169.47649,5227.272 1166.16449,5227.056 1163.86049,5227.056 C1156.30049,5227.056 1153.49249,5229.144 1153.49249,5234.112 C1153.49249,5239.008 1155.72449,5241.312 1163.71649,5241.312 C1167.38849,5241.312 1170.26849,5240.952 1172.42849,5240.16 C1173.58049,5239.656 1173.79649,5239.44 1173.79649,5238.072 Z" id="Aa" fill="#202020"></path>
                </g>
              </svg>
              <p class="review-list-item__description">Pantone Regular</p>
            </li>
            <li class="review-list-item _small _EB681A">
              <p class="review-list-item__description">EB681A</p>
            </li>
            <li class="review-list-item _small _349EEB">
              <p class="review-list-item__description">349EEB</p>
            </li>
            <li class="review-list-item _small _123752">
              <p class="review-list-item__description">123752</p>
            </li>
          </ul>
        </div>
      </div>
    </section>

    <bottom-navigation />
    
  </main>
</template>

<script>

  import BottomNavigation from '../../layout/bottom-nav/index.vue';

  export default {
    name: "Travel-App",
    components: { BottomNavigation },
    data: () => ({
      Apps: [
        {
          name: 'Cinema 4D',
          icon: 'C4D_Logo.png'
        },
        {
          name: 'Adobe Photoshop CC',
          icon: 'photoshop-cc.png'
        },
        {
          name: 'Zeplin',
          icon: 'zeplin.png'
        }
      ]
    }),
    computed: {
      isMobile () {
        return window.device.mobile()
      },
      isIOS () {
        return window.device.ios()
      }
    },
    mounted () {
      window.AOS.init();
    }
  };

</script>

<style lang="scss" src="./style.scss"></style>
